tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Manage compile and link flags for libraries
brew "pkg-config"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Asynchronous event library
brew "libevent"
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU database manager
brew "gdbm"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Library for command-line editing
brew "readline"
# Improved top (interactive process viewer)
brew "htop"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Portable Foreign Function Interface library
brew "libffi"
# NAT port mapping protocol library
brew "libnatpmp"
# YAML Parser
brew "libyaml"
# Run a Kubernetes cluster locally
brew "minikube"
# UPnP IGD client library and daemon
brew "miniupnpc"
# Command-line interface for SQLite
brew "sqlite"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python dependency management tool
brew "pipenv"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# QR Code generation
brew "qrencode"
# Cross-platform application and UI framework
brew "qt@5"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Contract-oriented programming language
brew "solidity"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# High-performance theorem prover
brew "z3"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Desktop wrapper for OpenAI ChatGPT
cask "chatgpt"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Personal blockchain for Ethereum development
cask "ganache"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# HTTP and GraphQL Client
cask "insomnia"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Interface for reading and syncing eBooks
cask "kindle"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Minimal installer for conda
cask "miniconda"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Desktop virtualization software
cask "parallels"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# VPN client focusing on security
cask "protonvpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Modern programming language in the Lisp/Scheme family
cask "racket"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Terminal emulator, SSH and serial client
cask "tabby"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin19"
# Customizable email client
cask "thunderbird"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Free messaging and calling application
cask "wechat"
# App wrapper for music.youtube.com
cask "yt-music"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
vscode "albert.TabOut"
vscode "alexcvzz.vscode-sqlite"
vscode "Andes.racket-repl"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "Calvin-LL.racket-helpers"
vscode "Certora.evmspec-lsp"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "evzen-wybitul.magic-racket"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "jebbs.plantuml"
vscode "josefpihrt-vscode.roslynator"
vscode "JuanBlanco.solidity"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "lishizhen.racket-fmt"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscode-dotnet-sdk"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Symflower.symflower"
vscode "tamasfe.even-better-toml"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
