tap "homebrew/bundle"
tap "homebrew/services"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Ruby environment tool
brew "chruby"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Contract-oriented programming language
brew "solidity"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# GPU-based terminal emulator
cask "kitty"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Get up and running with large language models locally
cask "ollama"
# Desktop virtualization software
cask "parallels"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# VPN client focusing on security
cask "protonvpn"
# Window snapping tool
cask "rectangle-pro"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "KakaoTalk", id: 869223134
mas "Kindle", id: 302584613
vscode "albert.tabout"
vscode "alexcvzz.vscode-sqlite"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.docker-explorer"
vscode "gimenete.github-linker"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "juanblanco.solidity"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sourcegraph.cody-ai"
vscode "tamasfe.even-better-toml"
vscode "tintinweb.ethereum-security-bundle"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-metrics"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-lll"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wholroyd.jinja"
vscode "zhuangtongfa.material-theme"
