tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/services"
# Statistics utility to count lines of code
brew "cloc"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Manage your Java environment
brew "jenv"
# Statically typed programming language for the JVM
brew "kotlin"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# High performance message passing library
brew "open-mpi"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Rust toolchain installer
brew "rustup"
# Solidity static analysis framework written in Python 3
brew "slither-analyzer"
# Linter for Solidity code
brew "solhint"
# Contract-oriented programming language
brew "solidity"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# GPU-accelerated terminal emulator
cask "alacritty"
# Memory training application
cask "anki"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Free and open-source web browser
cask "chromium"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Software for Logitech devices
cask "logi-options+"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Get up and running with large language models locally
cask "ollama"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Modern programming language in the Lisp/Scheme family
cask "racket"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@17"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "KakaoTalk", id: 869223134
mas "Kindle", id: 302584613
vscode "1yib.rust-bundle"
vscode "alexcvzz.vscode-sqlite"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "evzen-wybitul.magic-racket"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "juanblanco.solidity"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-speech"
vscode "naumovs.color-highlight"
vscode "nomicfoundation.hardhat-solidity"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
