tap "homebrew/bundle"
tap "homebrew/services"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Manage your Java environment
brew "jenv"
# Statically typed programming language for the JVM
brew "kotlin"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Source code analyzer for Java, JavaScript, and more
brew "pmd"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Contract-oriented programming language
brew "solidity"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# GPU-accelerated terminal emulator
cask "alacritty"
# Memory training application
cask "anki"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Free and open-source media player
cask "iina"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Software for Logitech devices
cask "logitech-options"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Get up and running with large language models locally
cask "ollama"
# Desktop virtualization software
cask "parallels"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Client for Proton Drive
cask "proton-drive"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@17"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
vscode "amodio.tsl-problem-matcher"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
